package com.mutoumulao.expo.redwood.entity;

import java.io.Serializable;
import java.util.List;

/**
 * Created by lzy on 2018/8/10.
 */

public class HomeListEntity implements Serializable{

    /*
     * id : 31
     * title : 被北大录取的寒门女孩：贫穷里的站立姿态才是未来生活的打开方式
     * author_id : 3
     * author_name : 木頭木佬
     * content :
     1
     王心仪高考707分，被北大录取了，现在，家里收到了北京大学的录取通知书。

     她弟弟用家里亲戚给的智能手机，细细地把通知书都拍了图给她。

     因为，王心仪此时正在外打工。
     在微信上看到录取通知书的这个夜晚，她失眠了，回望自己的来时路，温暖而艰辛
     王心仪说，自己的成长就是一个关于贫穷和希望的故事。

     王心仪家住在河北枣强县的一个村子里，家里有三个孩子，大弟弟即将升入高三，小弟弟还在幼儿园，妈妈身体不好，常年离不开医药，姥爷卧床，生活不能自理，全家人靠爸爸打工和两亩薄田艰难度日。

     姥姥几年前，患上乳腺癌，没有钱，就无法尽力医治，姥姥辛苦一辈子，未能安享晚年就已离世了。

     王心仪说，也许就算当时家里富有，也不能留下姥姥，可心里还是觉得很遗憾。但是，这件事后，她也明白了，谈钱不庸俗，它是基本的生活保障，它能帮我们用尽全力去留住珍爱的人和物，也明白了自己要更早地担起生活。

     王心仪和大弟弟自从上了小学三年级之后，就一直是妈妈骑自行车送他们到乡里，王心仪坐在后座，弟弟坐在自行车前梁上，三个人像“演杂技”一样，遇到难走的路，姐弟俩就要下来跑一段。碰上大雪，他们就要步行回家，从放学走到天黑。

     家境贫困，他们身上穿的都是别人送的旧衣服，土掉渣的棉袄，开了口的鞋子，奇怪的搭配，他们也曾受到别人的嘲笑，妈妈怕自己的寒碜拖累孩子，甚至不敢去参加家长会。

     即便是现在，小弟弟身上穿的，还是别人给的旧裙子。

     2

     王心仪一家一直都沉浸在贫穷之中。

     贫穷有时会刺痛人们，因为物质的匮乏，会让内心有更深的困窘。

     林清玄说，他的一个朋友从小家里困难，整天吃红薯稀饭，他离开家乡的时候，就发誓再也不回来了，十几年都不想再看到红薯稀饭。
     贫穷中，有人匍匐于地，有人泣血狂奔，有人却高昂着头、路上还有欢声笑语，而贫穷中的站立姿态，才是今后生活的打开方式。

     妈妈就教她，贫穷不能放弃希望，王心仪很小就识字背诗词。

     连上学也比其他孩子早一年，妈妈说，这不是为了和谁攀比，而是，希望知识可以让女儿更早地摆脱蒙昧和无知。

     穷，更不能放弃骨气。即便生活贫穷，也要自己扛起来，贫穷不是懒惰的借口，也不是索求帮助的资本。

     穷，也不要忘记快乐。没有芭比娃娃、没有动画片、没有零食，可王心仪有田间地头的大把的欢乐时光。

     王心仪说：我从卑微处走来，亦从卑微之处汲取生命的养分。

     幸福不是因为生活是完美的，而在于你能忽略那些不完美，并尽力地拥抱自己所能看到的美好和阳光。
     感谢贫穷，给予自己生生不息的希望与永不低头的气量。

     这样的王心仪，像个小太阳一样，即便是看看她纯净灿烂的笑脸，都能感受到力量。

     贫穷不可怕，被贫穷踢到了膝盖，跪在了物质里，才是可怕。

     穷了心，不管未来拥有多少物质财富，都是一个穷人。

     而内心富足的人，那些物质上的财富，时间早晚都会把它带到的。

     3
     知乎上有一个故事：

     小何小的时候，奶奶会将馊了的奶粉喂给他喝，因为家穷，奶粉贵，舍不得扔。

     小何喝了奶粉拉肚了，奶奶还是不舍得扔，自己喝了，病了更久。

     家里的电插头，每次插电都会打火，可是舍不得换新的，没啥，将就着用呗。后来，用电失火，烧了房子，就更穷了。

     去亲戚家串门，亲戚给个苹果，舍不得吃，爸妈让小何揣在兜里，最后，苹果烂了。

     后来上学了，街坊邻居看小何成绩还好，就劝妈妈供他读书，妈妈说：我也想供他读书，可是，哪有钱，谁给我钱啊。

     中考时，别人都希望自己的孩子考得好，只有小何妈妈说，考不好正好出去打工，咱家就不是读书的料。

     小何在城里打工，在一个行当里混久了，就想和朋友一起出来创业。

     父母死活不同意，自己做，要几万块的本钱，给别人卖手艺，旱涝保收。咱就是穷人的命，做不了那大买卖，赔了咋办。
     没几天，妈妈说自己病了，让小何把手里的钱寄回家。

     小何当天就汇了出去，自己安顿一下，也准备回去照顾妈妈。

     还没等小何出发，妈妈说，自己没病，钱都买料了，今年建房子，小何年龄大了，没房子娶不上媳妇。

     钱用来建房子是正事，也省得小何乱动心思。

     后来，房子建好了，可是，村里出来打工的人越来越多，想要半价，都卖不出去。

     小何依旧在城里到处打工，妈妈依旧日日催他回家相亲。

     而朋友的店面，已是日进斗金。

     蜷缩在角落里的小何也渐渐麻木了，收拾收拾，年底就回去结婚了。

     这个世界最难的事，不是，你不行，而是，你不配。

     太穷了，那些富有的事，都与你无关。

     4
     生活中，有太多的穷人
     让人走投无路的不只是没钱，更是缺钱的那颗心。

     是的，有些人，可能一辈子也不可能成为清华北大的学生，不可能成为富翁，不可能走到“罗马”……

     可是，那些金字塔尖，也许，不是大多数人的目标，那里，也不是幸福的集散地。
     终其一生，我们只是渴望，能少受贫穷的挤压，能有更多的选择权，能让爱的人多一点自由和舒适。

     而这些，不是财富到达什么样的指数，才能拥有。

     所以，即便身处贫穷之中，也该有昂首阔步的勇气。

     只要肯努力，生活总会比原来好一点，再好一点。

     富翁也不是万能的，谁的人生都是苦与悲。我们的艰难，不全是因为贫穷，只要心没有放弃，多难的路，都能走到尽头。

     * images : ["/avatar/c58da7fe253d808a5091d36128d390d7.jpg","/avatar/2b5fa75f65977d8bc76bf0db69cb831f.jpg"]
     * is_top : 0
     * category : 热门
     * created_at : 2018-07-31 04:34:37
     * updated_at : 2018-08-05 10:59:02
     * time : 5天前
     */

    public String id;
    public String title;
    public String author_id;
    public String author_name;
    public String content;
    public String is_top;
    public String category;
    public String created_at;
    public String updated_at;
    public String time;
    public String avatar;
    public String images;
    public List<CommentEntity> list;
    public String phone;

    public static class CommentEntity implements Serializable{
        /*
        	"id": "1",
			"author_id": "1",
			"article_id": "31",
			"content": "Ain’t ",
			"images": "",
			"created_at": "2018-08-08 08:30:51",
			"avatar": "/avatar/default.jpg",
			"nickname": "15172432690",
			"time": "1天前"
         */
        public String id;
        public String author_id;
        public String article_id;
        public String content;
        public String images;
        public String created_at;
        public String avatar;
        public String nickname;
        public String time;

    }

}
